[Rainmeter]
@Include1=#@#PanelSettings.ini
;别 改 刷 新 间 隔 ！
Update=1000
AccurateText=0
DynamicWindowSize=0
SkinWidth=(#MainPanelOffsetX#+800)
Group=ToggleByAssistBtn

[Metadata]
Name=Rhodes_Island_UI
Author=热心炎国云玩家
Information=让您在PC上也能享受到罗德岛终端系统的交互界面。|此为右面板组件组合。
License=Closure Commons 署名-不许获利-传递下去 42.0
Version=0.9.0

[Variables]
;导入Skins
@Include1=#CURRENTPATH#Terminal\#MainPanelTerminalType#.ini
@Include2=#CURRENTPATH#Operator\Double.ini
@Include3=#CURRENTPATH#Store\Links.ini
@Include4=#CURRENTPATH#Mission\Button.ini
@Include5=#CURRENTPATH#Base\Storage.ini
;导入独立自定义配置
@Include9=#@#PanelSettings.ini

;强制关闭可视化，在本缝合中启用可视化降低刷新间隔是不理智的。
ShowVis=0
;设置位置
TerminalX=#MainPanelOffsetX#
TerminalY=0
OperatorX=(#MainPanelOffsetX#-40)
OperatorY=260
StoreX=(#MainPanelOffsetX#+65)
StoreY=430
MissionX=#MainPanelOffsetX#
MissionY=(600-4)
BaseX=(#MainPanelOffsetX#+20+310)
BaseY=(600-8)


[RowBtnPlaceHolder]
Meter=Image
SolidColor=0,0,0,150
X=(#OperatorX#+((370+20)*2))
Y=#OperatorY#
W=150
H=150